Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Who's Mr. President.tmx
Source language: id
Languages: en

source: DAN SEPERTI
en: And, of course,

source: Sebentar ya, Paman lepas dulu talinya…
en: hang on, I’ll untie the rope.

source: K-KALAU BEGITU...
en: we-well then...

source: KAMU NGOMONG
en: what are you trying to say,

source: DIUMUMKAN?
en: whose appointment was announced publicly?

source: BEGINI?
en: by the gate like that?

source: DEMI IBU…
en: sake, Ms. Nina!

source: KAU
en: do you have

source: SELESAIKAN MASALAH
en: and make

source: MENGETAHUI TENTANG
en: no idea about

source: MELAKUKANNYA DENGAN
en: do it

source: DAN PERASAAN
en: And

source: JUJUR SAJA,
en: Admit it!

source: AKU…
en: I...

source: Ternyata
en: So...

source: T-Tapi sepertinya tempai ini terlalu ramai,
en: b-but there are too many people here...

source: APA YANG MEMBUATMU TETAP BERTAHAN DI OSIS?
en: what makes you stay in osis?

source: DI ANTARA MEREKA BERDUA
en: There was like a rift

source: LEO SENDIRI.
en: to do this!

source: SELAMA INI
en: Knowing that

source: KREK
en: creak

source: UKH...
en: uh...

source: DAN JUGA
en: and your

source: BISA DIBILANG AKU
en: I’m the one

source: GELAP TERUS MENERUS,
en: the dark for too long,

source: …ITU BERARTI,
en: Does this mean...

source: JADI CERITANYA,
en: The story goes like this,

source: INI.
en: happen.

source: KAK EZRA SAJA?
en: with you.

source: DAN PILIHAN YANG
en: And, There’s no decision

source: YA…
en: okay?

source: KAMU TAHU
en: Did you know

source: WAKATOS DISAMBUT
en: the vice president

source: MENDAPAT
en: texted

source: AKAN PERCAYA APA
en: believe

source: "Beritahu aku lokasi paling teramai di festival,
en: “tell me the most crowded spot at the festival,

source: dengan tukang gosip!
en: and a busybody!

source: TADI KAK LEO BILANG
en: he said that

source: TERNYATA INI
en: Oh... so

source: DIA MENGAKU-
en: he claimed to be

source: KAU ADA DI SINI
en: drag you

source: KAKAK 'KAN
en: well,

source: APA BENAR
en: Are you really

source: KALAU AKU MEMANG
en: If I were

source: ANGGOTA OSIS YANG
en: the only member of OSIS

source: KENAPA DIA MEMILIH
en: Why did

source: KALIAN KETAHUI
en: you

source: DIA NASIHAT!!
en: some advice!

source: EGOIS SEKALI,
en: Tsk, what a selfish guy.

source: JADI, SOAL
en: oh, since

source: TAPI KALI INI…
en: But, this time...

source: Tidak apa-apa, Chiara sudah tahu juga aku siapa.
en: it’s okay. she knows who I am.

source: INTINYA, MOTIVASI NEVADA MENJADI GURU TIDAK SEPERTI YANG KALIAN KIRA,
en: the point is, nevada has his own motivation to be a teacher.

source: DATANG MESKI
en: on such

source: Ya.
en: Yes.

source: Tapi di cuaca
en: But, the weather is

source: INI, YA..?
en: huh?

source: TIDAK MUNGKIN
en: Well, I’m doing

source: HAL MEREPOTKAN
en: like

source: Bagaimana pun juga Cantika adalah anaknya Pak Nev…
en: after all, cantika is mr. nev's daughter.

source: MENDEKATIKU.
en: something.

source: E-Eh?
en: h-huh?

source: SOAL KELUARGA SANJAYA, SEPERTINYA MEREKA MEMANG KELUARGA YANG AGAK UNIK...
en: oh, about the sanjayas... I also find them quite eccentric.

source: begitu sih, tapi
en: we can put it like that.

source: OSIS!??
en: OSIS too?!

source: S-SEBENTAR, SEBENTAR!!
en: w-wait!!

source: Ah… jangan-jangan
en: Ah... could it be

source: Tidak usah sok pengertian dalam situasi seperti ini!!
en: oh, don’t act like you care!!!

source: SOAL YANG TADI, KAMI JUGA SUDAH MENCARI INFORMASI TENTANG KEVIN...
en: alright, so... we’ve found some information about kevin...

source: DI AUDITORIUM.
en: this instance.

source: KECEWA.
en: you, chiara.

source: …Suara pencuilknya!
en: the kidnapper’s voice!

source: PERMISI.
en: excuse me.

source: UNTUK CHIARA,
en: some space.

source: TAHU KEBENARANNYA.
en: about the truth.

source: MANTRA DENGAN
en: like a mantra

source: GELAP?
en: room?

source: BAGAIMANA PAK ARDHAN KECEWA DENGAN KEPSEK,
en: ...about how mr. ardhan was disappointed in the principal...

source: MEMBAHAS HAL
en: talking about it,

source: GAK KAMU,
en: Stop

source: MAU MELAKUKAN
en: do something

source: …Aku sering melihat kejadian seperti ini di film-film,
en: I’ve seen kidnapping scenes like this in a movie.

source: ENTAH SEJAK KAPAN,
en: I’m not sure...

source: TAPI SAYA INGIN
en: but I want to hear

source: M-MAAF...
en: s-sorry...

source: AKU CURIGA DIA
en: I suspect that

source: TELAH MENGHABISKAN
en: I’ve spent a considerable

source: SOALNYA KEMARIN JUGA 'KAN BARU ADA KEJADIAN-
en: last time, there was an incident tha-

source: MENGETAHUI SEMUA
en: know the identity of every

source: SESEORANG UNTUK
en: someone to

source: B-BARUSAN...
en: earlier...

source: ...BAIKLAH,
en: okay then...

source: GAK ENAK.
en: between them.

source: *Percakapan Chiara dan Pak Nec di EP 47
en: *the conversation between chiara and mr. nevada in ep 47

source: firasatku tidak
en: feeling about

source: G-GILA!!
en: dammit!

source: mengontrol
en: control

source: KARENA TINGGI DAN
en: Ms. Nina and I

source: DENGANKU HANYALAH
en: because they’ve

source: YANG BISA DIDUGA
en: of a diligent girl

source: Bisakah setidaknya Paman melonggarkan ikatan Cantika?
en: can you at least loosen her ties a little bit?

source: sudah ijin?
en: I couldn’t come to practice...

source: SEJUJURNYA
en: To be honest,

source: DIA MENGHINDARIKU?
en: avoiding me.

source: Baiklah.
en: okay.

source: WALAUPUN AKAN
en: I understand that

source: Nah, sudah selesai.
en: okay, done.

source: ORANG SEPERTIMU
en: that you’re

source: MEMANG BERENCANA
en: It was decided that we were going to

source: KENAPA ADA
en: What’s this

source: IDENTITAS ANGGOTA OSIS.
en: OSIS member.

source: TERNYATA DIBIARKAN
en: So this is

source: SOAL ITU, AKU MAU
en: I want to

source: H I I I Y ! !
en: dun

source: MEMINTA WAKATOS
en: who asked the vice president

source: KARENA SAYA TIDAK
en: I didn’t want to

source: Hantu kepsek…
en: Hedwig...

source: SEBENARNYA ADA
en: Just what the heck

source: Aku Ketua
en: I’m

source: DI SINI?
en: there?

source: CHIARA PERLU
en: Chiara needs

source: UNTUK UKURAN
en: someone

source: PAK NEV MEMANG HEBAT, BISA MEMBUAT KONSPIRASI SEPERTI INI!
en: mr. nevada is amazing for making conspiracy like this!

source: AKU HARUS
en: I need to

source: KOK, AKU MERASA TERJADI DEJA VU, TAPI LEBIH PARAH, YA?
en: this feels like a deja vu, but kinda worse, eh?

source: Kak Ezra
en: Ezra has

source: AKU MENGETAHUI
en: for me to

source: ITU BIKIN ULAH!!
en: that damn playboy!

source: AKU MELAKUKAN
en: why would I do

source: SAAT INI CHIARA
en: Chiara

source: anggota OSIS
en: OSIS member

source: KAMU DENGAR,
en: easy for you to process.

source: tau?
en: know?

source: LAKUKAN.
en: move.

source: YANG BARU SAJA
en: what he

source: TEMAN SAYA,
en: Ara

source: dan skandal terbaru,
en: gossip and scandals,

source: KEBETULAN
en: Also,

source: LAMA JUGA AKU TIDAK
en: since we talked

source: ADA.
en: everyone.

source: MELAKUKAN SEMUA
en: always does what she’s asked

source: Jelas-jelas aku sedang melindunginya!
en: clearly I’m protecting her.

source: TADI KAMU BILANG
en: he’d been

source: SESUATU YANG MENGUSIK
en: has been troubling

source: HAL INI PATUT UNTUK DISELIDIKI LEBIH LANJUT,
en: we should investigate this further,

source: OSIS UNTUK MASALAH
en: OSIS for his own

source: bahkan yang paling
en: even the most confidential

source: UNTUK MENYELIDIKI
en: You two will

source: KEPERCAYAANNYA, LALU
en: me anymore...

source: DENGAN KAK LEO
en: that

source: MENGUNJUNGI
en: was

source: SEKARANG?
en: here?!

source: sepanas ini, adanya
en: too hot.

source: BELAKANGAN.
en: this later.

source: LEBIH BANYAK LAGI…
en: know...

source: S-SEPERTI, APAKAH
en: I mean... did

source: MENIKAH..?
en: married?

source: K-KAKAK KENAPA..??
en: A-are you okay?

source: SEKOLAH INI HANYA
en: the school

source: MENURUTI APA KATA
en: you had listened

source: SEPERTI ITU,
en: remarks.

source: TIDAK ADA YANG
en: when they

source: YANG ANEH GAK
en: anything weird about her

source: HANYA MENYUSUN
en: we were doing this

source: RUANGAN LAIN,
en: in the other room,

source: TIBA ADA BANYAK
en: with the

source: HAL SEPERTI INI.
en: kind of things.

source: SAYA SEDANG
en: am I getting

source: MENUDUHKU YANG BUKAN-
en: accuse me

source: Memangnya kamu
en: You don’t have

source: ...TAPI,
en: but...

source: TIDAK BISA BERKATA-
en: say

source: KEPSEK ITU?
en: old friend.

source: KERJA BAGUS,
en: Good job,

source: RAJIN ATAU NGGAK!??
en: diligent girls or not?!

source: INI BENAR-BENAR
en: really

source: PEMBICARAAN.
en: the conversation.

source: MELIHAT SISI
en: seen

source: SORI!!
en: Please, have mercy!

source: jangan ditiru!
en: do not try this at home!

source: "JIKA URUSAN
en: “If the emergency

source: SAYA BISA JAMIN KALAU NEVADA YANG SEKARANG TIDAK TERLIBAT.
en: I can guarantee that nevada had nothing to do with it.

source: EEEH??
en: What?

source: lain.
en: students.

source: ARA DAN ABIGAIL…
en: and Abigail,

source: PESAN INI,
en: included in the announcement.

source: LAKUKAN DI
en: you

source: AKTING.
en: an actor.

source: CHIARA SENDIRIAN,
en: leaving her alone with him like this,

source: MENGGANGGUMU,
en: mind,

source: Diam!
en: shut up!

source: untuk memotong rambut Ezra.
en: in order to cut Ezra’s hair.

source: APAKAH ADA
en: Is this

source: APA ITU?
en: what is it?

source: DEMI MELINDUNGI
en: to protect

source: EZRA PRANADIPA ITU
en: has an older brother

source: UNTUK MENJADI OSIS,
en: member of OSIS.

source: OLEH PESAN ITU BUKAN
en: isn’t

source: AKU TIDAK MENDEKATI
en: So that I won’t hit

source: CARAMU MENGGUNAKAN KARAKTER DAN PERASAAN ORANG UNTUK MENDAPATKAN APA YANG KAU INGINKAN INI CUKUP MENGERIKAN!
en: it’s terrifying how you read people’s personalities and exploit their emotions to your advantage.

source: M-maafkan aku..!!
en: I-I’m so sorry!

source: INI SEJAK AWAL?
en: this from the start?

source: SEGINI SAJA TIDAK
en: I don’t think

source: DIALOGNYA SEPERTI
en: his dialogue

source: KAMU BERTANYA
en: So,

source: TEMANNYA TADI…
en: chiara’s friends too...

source: menjabat sebagai
en: of OSIS for the

source: ADALAH SANG
en: the guardian

source: SEBAGAI JABATAN
en: As the highest ranking members,

source: INFORMASI YANG
en: quite

source: KALIAN SUDAH
en: for coming

source: MEMANG ITU BISA
en: Maybe it was

source: TIDAK PERLU RIBET
en: This wouldn’t have

source: TENTU SAJA
en: Of course

source: DONG, AKU MALAH
en: Thank you

source: Kepsek!
en: mr. principal!

source: DAN KITA LIHAT APA YANG AKAN TERJADI SELANJUTNYA.
en: and we’ll see what happens next.

source: …Kakak juga tidak tahu.
en: I don’t know.

source: INI TIDAK AKAN
en: This won’t

source: DINGIN-DINGIN…
en: something refreshing.

source: POSTUR BADANKU
en: are the same height with

source: MENCURIGAI
en: rude,

source: SENIOR JUDES
en: from

source: LEO MEMANG JAGO
en: to be quite

source: SEKOLAH ADALAH
en: just for

source: A-Ah…Soal itu…
en: um... about that...

source: KAKAK.
en: Ezra.

source: HAL YANG HARUS
en: I should

source: DAPAT INFORMASI
en: information,

source: DAN KAK
en: However,

source: Bedakan
en: There’s a difference between

source: Mereka penculik yang berhati rapuh!
en: they have such a soft heart!

source: JUGA..?
en: they know...?

source: KARENA KALIAN MENCURIGAI SAYA?
en: ...because you've been suspicious of me?

source: PAHAM, TADI
en: I was

source: APA KAKAK ADA
en: are you

source: TIDAK, HANYA
en: not at all!

source: TIDAK ADA SATU
en: Nobody

source: ORANG ITU TIDAK
en: please

source: MELAKUKAN ITU..?
en: do it?

source: Kalian semua bertengkar seperti anak kecil!
en: you guys quarrel like kids.

source: TAKUT DITOLAK?
en: You’re afraid of getting rejected, huh?

source: DIA HANYA PINTAR, SISANYA RATA-RATA!!
en: she’s just smart. everything else about her is just bang average!

source: TIDAK HANYA DENGAN OSIS, TAPI JUGA DENGAN SEMUA ORANG YANG DEKAT DENGANMU.
en: not only disappointed in osis... but also everyone close to you.

source: MAAF JIKA KAMI
en: if we’ve

source: DARIKU!!
en: that at all!!!

source: INI KARENA
en: This is what happens

source: BUANG AIR,
en: to pee.

source: KALAU TEMPAT
en: that we’re in

source: INTINYA, KAU
en: Oh...

source: GAWAT, AYO
en: This is bad.

source: AKU PUNYA DUGAAN KALAU KAK EZRA MUNGKIN BAGIAN DARI OSIS.
en: ...when I started suspecting ezra was a part of osis.

source: TIDAK
en: Are you sure no one

source: KAMU SERING DIPUJI
en: The teachers have been speaking

source: DARI SITULAH
en: you two

source: PENJAGA OSIS,
en: of OSIS...

source: INFORMASI INI.
en: this.

source: INI BARUSAN,
en: recently.

source: SAYA SUDAH MEMUTUSKAN UNTUK TIDAK SAMA SEPERTI KELUARGA SAYA.
en: I’ve decided not to follow in their footsteps.

source: KARENA DIA
en: ...this person

source: ADA KEPERLUAN,
en: approach me

source: INI!??
en: necessary?!

source: SAMPAI SITU,
en: anymore.

source: SEKOLAH, ORANG-
en: applies

source: …HEI, KAU
en: Hey,

source: PADA AKHIRNYA,
en: But, the truth is,

source: mudah menangis.
en: crybaby.

source: MAU AKU JELASKAN?
en: have an explanation?

source: A-AYO KITA KEMBALI FOKUS.
en: let’s get back to the topic.

source: DIA PASTI MENYIMPAN
en: she has

source: dengan Bu Nina?
en: on Ms. Nina...

source: SIAPA DALANG
en: need to find

source: Seperti cemburu karena dia dekat dengan Chiara, misalnya.
en: maybe you’re jealous because he’s close with chiara.

source: KAMI MENEMUKAN
en: we found

source: Tidak ada yang bisa menyangkal.
en: nobody could deny it.

source: SALAH PAHAM…
en: to misunderstand...

source: BARU SADAR,
en: You just realized,

source: MEMBERI SAYA
en: gather some

source: SI SEKOLAH YANG PERATURANNYA KETAT BEGINI, KAK EZRA BISA LOLOS DENGAN PELANGGARANNYA ITU.
en: despite the fact that this school is notoriously strict, ezra has escaped any sort of punishment for his offences.

source: MEREKA UNTUK
en: to get and stay

source: HARI INI, KALIAN
en: for today!

source: ORANG SAJA!!
en: on me!!!

source: AKU MENGINTERUPSI
en: I interrupted

source: pergi rupanya??
en: still here?!

source: …Tolong beritahu
en: Tell Ms. Nina

source: LEO LEBIH LANJUT,
en: on Leo.

source: ULAH ANAK
en: has

source: TERUS, LEO AKAN
en: Leo will

source: MAU MEMBEBANI IBU,
en: burden you,

source: EKSKUL TEATER…
en: The head of the theater club...

source: punya banyak
en: a lot free time,

source: apa nih?
en: what do you have in mind?

source: PADAHAL CHIARA PERNAH BERPIKIR KALAU SEMUA ORANG MENDEKATI DIA HANYA KARENA OSIS,
en: chiara used to believe that everyone wanted to be close to her simply because she was an osis member.

source: CHIARA HANYA
en: said

source: Mau makan
en: Sure!

source: SANGAT TERTARIK
en: very interested in her

source: KARENA ITU!
en: with chiara!

source: BAGAIMANA PUN JUGA ITU ADALAH DIDIKAN KELUARGA YANG TIDAK LAGI INGIN KAMU HIDUPI, BUKAN.
en: after all, those are the traits you don’t want to inherit from your family, right?

source: PLOT TWIST.
en: twist.

source: SAYA MENYADARI, ENTAH UNTUK ALASAN APA...
en: for some reason, I got the impression that...

source: TUGAS PADA KALIAN
en: a mission

source: AKU DENGAR KAU
en: I heard

source: PERASAAN ORANG!
en: other people’s feelings!

source: KALIAN MAU
en: Having a tea party

source: MENYADARI ADA
en: have you noticed

source: AKAL-AKALANMU
en: all

source: INI KEBETULAN,
en: I don’t want to scare you,

source: CHAT DARI
en: Oh!!! She sent

source: Aku sampai harus mencarimu ke mana-mana, padahal aku masih harus bersiap untuk teater nanti!
en: I had to find you everywhere while I still have to prepare for the theater!

source: HI
en: Hee

source: AKU SELAU MENGHINDARI PERTEMANAN KARENA KEBANYAKAN ORANG PUNYA MAKSUD TERSEMBUNYI.
en: I’ve been reluctant to build friendships because I believe most people have hidden motivations.

source: AKU MEMUTUSKAN UNTUK TIDAK DIAM DI KELAS...
en: ...I decided not to stay in the classroom.

source: APAKAH INI
en: Are you really gonna

source: HOI, AKU TAHU KAU FANS-NYA PAK NEV,
en: hey, I know you like him,

source: JADI BEGITU..?
en: I see...

source: MENGENAL CHIARA,
en: I know chiara.

source: HOI.
en: Oi.

source: TIDAK BISA
en: couldn’t

source: yuk!
en: eat something?

source: TAPI AKU RASA
en: but i think

source: SELESAI?
en: done?

source: WAKTU YANG TEPAT..!
en: the right moment!

source: INFORMASI HANYA UNTUK
en: spread the info I got

source: *Ini Ezra.
en: *it’s ezra

source: DARI OSIS?
en: of OSIS?

source: PERCAYA KAKAK DAN
en: you instead of

source: Dalam perjalanan ke Tata Usaha
en: On their way to the administration office

source: DAN DIA JUGA
en: Naomi is the cousin

source: DAN SANGAT PEDULI
en: he seems to be very

source: PULANG DULUAN!??
en: to go home?!

source: AAAND
en: And

source: Apa benar dia
en: Maybe he’s

source: SAYA LEGA MELIHAT MEREKA BERDUA HARI INI.
en: it’s nice to see those two today.

source: …BEGITU
en: I

source: APAPUN ORANGNYA,
en: he is,

source: NAOMI SELALU
en: if you keep

source: A-AKU HANYA
en: I-I was just

source: KETUA OSIS.
en: to be the president.

source: SAYA,
en: furious...

source: T-Tapi HP itu 'kan banyak hal priviasi!!
en: b-but it’s privacy!

source: KITA AKAN MEMBONGKAR SEMUANYA...
en: we’re going to uncover everything.

source: DIJAUHI TEMAN-TEMANNYA.
en: very quiet because your friends were avoiding you.

source: UMUR!
en: devil!

source: TIDAK.
en: I don’t think so.

source: TIDAK MASALAH,
en: not a problem,

source: DIA BILANG
en: Mr. Nevada said

source: WAKIL KETUA OSIS
en: the vice president

source: BUTA, AKU PAHAM
en: that love

source: Dia akan mengerti maksud dan tujuanku ke mana!
en: I’m sure she’ll understand my plan!

source: utama?
en: character?

source: KALAU DIA MENGETAHUI
en: if she knows

source: Kamu ini bicara apa, Cantika!
en: what are you talking about, cantika?!

source: KITA SEMUA BELAJAR
en: that this would

source: KALAU AKU ADA
en: that I’m on

source: MEMANG BENAR KELUARGA SANJAYA MEMANG TERLIBAT DENGAN BANYAK HAL,
en: the sanjayas are certainly involved in many things,

source: MASALAH YANG
en: more important things

source: BOLEH BANGET
en: Of course you can wait for me!

source: DI SANA.
en: is!

source: BAKAT SAYA DI TEATER,
en: as talented as I am today.

source: BANYAK HAL.
en: have her own doubts.

source: TAPI SKENARIO
en: But, there’s

source: SANA JAUH-JAUH!
en: stay away from me!

source: INI LANGKA!
en: rare info!

source: SANGKA TERNYATA ALASAN
en: who would’ve thought

source: TETAP KETUA
en: of OSIS,

source: DIATUR,
en: from the beginning...

source: KAU DENGAR ITU, EZRA??
en: you hear that, ezra?

source: SEKSI - SEKSI
en: Other Divisions

source: SEPERTI INI PUN
en: this situation,

source: NGOBROL DENGANMU.
en: right, Chiara?

source: SEKOLAH INI.
en: the school.

source: TIDAK BISA DENGAN
en: blindly put

source: SUKA NGACO!!
en: ridiculous!

source: TEMANI UNTUK
en: meet him?

source: KARENA SEMAKIN
en: ...the more

source: AKU BICARAKAN…
en: to tell you...

source: Kamu tidak benar-benar menyimak, 'kan?
en: were you paying attention to everything I said?

source: ADA SESEORANG
en: ...that someone

source: BERPIKIR AKU
en: think

source: KAK… JANGAN
en: Leo... stay

source: BENAR, SOAL ITU...
en: yeah, about that...

source: ...KALAU BEGITU, BAGAIMANA DENGAN PAK NEV?
en: then, how about mr. nevada?

source: PERHATIAN,
en: This is

source: PENTING…
en: be more significant, huh?

source: INI BUKAN UNTUK
en: all of this just

source: KELIHATANNYA MURAH HATI,
en: that this school is so generous

source: JADI PASTI DIAM-DIAM KAMU MELAKUKAN SESUATU.
en: so I think you must’ve done something.

source: MEMBUAT BANYAK
en: to make so many

source: TAPI SEBENARNYA, BANYAK POLITIKUS YANG MENJALIN KERJA SAMA DENGAN PENGUSAHA BESAR.
en: actually, there are many politicians who build close relationships with successful businessmen.

source: KARENA ITU DIA SANGAT MENGHARGAI PERTEMANANNYA SEKARANG.
en: that’s why she values so much her relationships with her current friends.

source: KATAMU?
en: secret room, you said?

source: "ORANG-ORANG
en: “surrounding me with members of

source: Merinding
en: getting goosebumps

source: ITU PASTI BENAR-
en: it was really

source: JUSTRU ITU, KENAPA DIA MAU JADI GURU??
en: that’s even more suspicious, why teaching?

source: ADALAH ORANG YANG
en: you were this

source: BICARAKAN?
en: with me?

source: ITU TIDAK MENGUBAH FAKTA KALAU MEREKA ADALAH TEMAN-TEMAN YANG BAIK BUAT SAYA.
en: ...it doesn’t change the fact that they’ve become good friends for me.

source: ARTINYA IBU
en: get married

source: Bukannya kak
en: I thought

source: JADI BEGINI...
en: um, actually, we...

source: sampai merah
en: face is

source: DAN KALAU MELIHAT CARA MEREKA MEMPERLAKUKAN SAYA,
en: considering how they treat me,

source: ADA HUBUNGANNYA.
en: I don’t see any correlation.

source: TAHU APAKAH INFO
en: if we can use

source: MAKAN YANG
en: to eat

source: MENGUASAI RUANGAN
en: You shouldn’t be using this room

source: KONFLIK, HINGGA
en: friction, or even

source: …SAYA MINTA
en: I’m sorry

source: GEDUNG SENI DAN BUDAYA, AUDITORIUM
en: ART AND CULTURAL BUILDING, AUDITORIUM

source: LULUS, KARENA ITU SAYA
en: so I thought that

source: TAPI SEBAGAI
en: but, as a fellow

source: SEPERTI INI TIDAK AKAN
en: wouldn’t cause

source: KAK EZRA!
en: Ezra!!!

source: TAHU SOAL ERLANGGA,
en: on Erlangga.

source: JAGA-JAGA?
en: Just in case...

source: CARA PALING MUDAH MENUNJUKKAN KITA MARAH ADALAH DENGAN DIAM DAN MENGHINDAR.
en: the easiest way to express our displeasure is to remain silent and avoid everyone.

source: MUNGKIN ITU
en: I guess that’s

source: TERLEBIH DAHULU.
en: try.

source: INI INFORMASI YANG
en: This is very valuable,

source: H-HAAH??
en: Wh-what?!

source: ADA HAL YANG BURUK
en: happened

source: KALAU BERANI!!
en: not!

source: TAPI SAYA
en: But, I did

source: T-TAPI SAYA 'KAN TIDAK BISA AKTING...
en: b-but I’m not very good at acting.

source: PERLAKUAN YANG
en: I

source: PASTI SUDAH TIDAK LAGI
en: Chiara

source: HATI DAN SUNGKAN.
en: and full of hesitation.

source: Y-Y-YO,
en: O-o-oi,

source: POSISINYA.
en: about her too...

source: PAK.
en: sir.

source: MURKA BESAR."
en: my wrath.”

source: PADANYA?
en: to her?

source: LEO..?
en: regarding Leo?

source: FIRASAT DIA
en: was

source: SUKA PEREMPUAN
en: like diligent girls

source: TERGESA-GESA
en: for me to immediately

source: PUNYA "RITUAL"
en: have their own “rituals”

source: DENGAN OSIS,
en: OSIS,

source: KAMU AKAN KECEWA?
en: you be disappointed?

source: 'KAN KEMARIN??
en: jealous when I spoke with Chiara yesterday, weren’t you?!

source: SEKITARMU.
en: so they can monitor you.

source: Tapi…
en: but...

source: berubah mengincar
en: to get close to

source: Sekarang Chiara, dan juga anak Bapak-
en: now it’s happening to chiara... and your daughter.

source: DENGAN MELAKUKAN
en: by doing

source: INI TIDAK
en: This isn’t

source: DENGAN KETUA OSIS,
en: with the president first,

source: NAOMI ADALAH ANAK DARI
en: Naomi is the daughter

source: DENGAN TELITI…
en: perfectly...

source: E-mail | melindasavenia@gmail.com
en: email | melindasavenia.art@gmail.com

source: MULAI BICARA
en: only

source: TENTANG YANG MAU
en: I’ve been meaning

source: Agak sok juga.
en: a bit big-headed.

source: kantor Bapak.
en: to your office.

source: PIKIR SAYA AKHIRNYA
en: I’d have a

source: HARUS MASUK AKAL.
en: needs to make sense.

source: Kita sudah sampai ke tempat ini sesuai perintah, apa yang harus kita lakukan sekarang?
en: We've arrived at this place as ordered, what should we do now?

source: BELAKANGAN INI
en: You seem

source: Dan di dalam mobil, mereka memakaikan penutup mata sehingga kami tidak bisa melihat ke mana kami dibawa.
en: they blindfolded us so we didn’t know where we were going.

source: Setelah membawa Cantika, ke mana aku harus menemui Kakak lagi?
en: where do we meet up after that?

source: TAPI TETAP SAJA AKU PUNYA KECURIGAAN.
en: I still have my suspicion.
